Revit 2026 API

# RouteAnalysisSettingsAnalysisZoneBottomOffset Property

---

The bottom plane offset, in ft, of the zone used in route calculation. Default value is 8".

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AnalysisZoneBottomOffset { get; set; }
```
```vb
Public Property AnalysisZoneBottomOffset As Double
	Get
	Set
```
```cpp
public:
property double AnalysisZoneBottomOffset {
	double get ();
	void set (double value);
}
```
```fsharp
member AnalysisZoneBottomOffset : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for bottomOffset must be non-negative. |

The zone's bottom plane elevation is different per plan view and is determined by adding the bottom offset to the view's level elevation.

#### Reference

RouteAnalysisSettings Class

Autodesk.Revit.DB.Analysis Namespace